Revit 2024 API
EvaluatedParameter.AsValueString Method (Document)
 Get the parameter value as a string with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string AsValueString(
	Document doc
)
Visual Basic
Public Function AsValueString ( _
	doc As Document _
) As String
Visual C++
public:
String^ AsValueString(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document to be used to obtain information about the parameter.
Return Value
 The string that represents the parameter value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
EvaluatedParameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace